---
kind: method
id: M:Autodesk.Revit.DB.ExportDGNSettings.SetDGNExportOptions(Autodesk.Revit.DB.DGNExportOptions)
source: html/afc5d70c-308f-7289-8391-eaaeb116ea86.htm
---
# Autodesk.Revit.DB.ExportDGNSettings.SetDGNExportOptions Method

Sets the options stored in these settings.

## Syntax (C#)
```csharp
public void SetDGNExportOptions(
	DGNExportOptions options
)
```

## Parameters
- **options** (`Autodesk.Revit.DB.DGNExportOptions`) - The options.

## Exceptions
- **Autodesk.Revit.Exceptions.ArgumentNullException** - A non-optional argument was null